#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

//int main()
//{
//	//指针类型决定了指针在被解引用的时候访问几个字节
//	//如果是int*的指针，解引用时访问4个字节
//	// 如果是char*的指针，解引用时访问1个字节
//
//
//	//指针的类型决定了指针+-1操作的时候，跳过几个字节
//	//决定了指针的步长
//	// 如果是int*的指针，指针+-1操作时跳过4个字节
//	// 如果是char*的指针，指针+-1操作时跳过1个字节
//
//	//野指针
//	//指针指向的位置不可知，随机的不正确的，非法的
//	//int* p;;//野指针，p指向的位置不可知，没有初始化
//	//*p = 10; //错误，p指向的位置不可知
//
//
//	//越界访问
//	int arr[10] = { 0 };
//	int* p = arr; //p指向数组的首元素
//	int i = 0;
//	for (i = 0; i <= 10; i++)
//	{
//		*p = i; //将i的值赋给数组的每个元素
//		p++; //指针p向后移动一个int的大小
//		printf("arr[%d] = %d\n", i, arr[i]);
//	}
//	return 0;
//}


//避免野指针
int main()
{
	int b = 0;
	int a = 10;
	int* p = &a;
	*p = 20;

	int* p2 = NULL;
	*p2 = 100;//错误
	if (*p2 != NULL)
	{
		*p2 = 100;
	}

	return 0;
}


